RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_flash.h
/**
  ******************************************************************************
  * @file    stm32h7rsxx_hal_flash.h
  * @author  MCD Application Team
  * @brief   Header file of FLASH HAL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32H7RSxx_HAL_FLASH_H
#define STM32H7RSxx_HAL_FLASH_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7rsxx_hal_def.h"

/** @addtogroup STM32H7RSxx_HAL_Driver
  * @{
  */

/** @addtogroup FLASH
  * @{
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup FLASH_Exported_Types FLASH Exported Types
  * @{
  */

/**
  * @brief  FLASH Erase structure definition
  */
typedef struct
{
  uint32_t TypeErase;   /*!< Mass erase or page erase.
                             This parameter can be a value of @ref FLASH_Type_Erase */
  uint32_t Sector;      /*!< Initial Flash sector to erase when sector erase is enabled
                             This parameter must be a value between 0 and (max number of sector - 1)
                             (eg : 15 for 128KB single bank) */
  uint32_t NbSectors;   /*!< Number of sectors to be erased.
                             This parameter must be a value between 1 and
                             (max number of sectors - value of initial page)*/
} FLASH_EraseInitTypeDef;

/**
  * @brief  FLASH Option Bytes Program structure definition
  */
#define FLASH_KEY_DATA_NB_REG (8U)  /*!< 8 Key data registers  */

typedef struct
{
  uint32_t OptionType;                  /*!< Option byte to be configured.
                                             This parameter can be a combination of the values of @ref FLASH_OB_TYPE */
  uint32_t WRPState;                    /*!< Write protection activation or deactivation (used for OPTIONBYTE_WRP).
                                             This parameter can be value of @ref FLASH_OB_WRP_STATE */
  uint32_t WRPSector;                   /*!< Specifies the sector(s) to be write protected (used for OPTIONBYTE_WRP).
                                             The value of this parameter depend on device used within the same series */
  uint32_t USERType;                    /*!< User option byte(s) to be configured (used for OPTIONBYTE_USER).
                                             This parameter can be a combination of @ref FLASH_OB_USER_TYPE */
  uint32_t USERConfig1;                 /*!< Value of the user option byte (used for OPTIONBYTE_USER).
                                             This parameter can be a combination of @ref FLASH_OB_USER_BOR_LEV,
                                             @ref FLASH_OB_USER_IWDG_SW, @ref FLASH_OB_USER_nRST_STOP,
                                             @ref FLASH_OB_USER_nRST_STDBY, @ref FLASH_OB_USER_XSPI1_HSLV,
                                             @ref FLASH_OB_USER_XSPI2_HSLV, @ref FLASH_OB_USER_IWDG_STOP,
                                             @ref FLASH_OB_USER_IWDG_STANDBY, @ref FLASH_OB_USER_VDDIO_HSLV */
  uint32_t USERConfig2;                 /*!< Value of the user option byte (used for OPTIONBYTE_USER).
                                             This parameter can be a combination of @ref FLASH_OB_USER_ITCM_AXI_SHARE,
                                             @ref FLASH_OB_USER_DTCM_AXI_SHARE, @ref FLASH_OB_USER_ECC_ON_SRAM,
                                             @ref FLASH_OB_USER_I2C_NI3C */
  uint32_t HDPStartPage;                /*!< Start address that contains the first 256-byte block of HDP area (used for OPTIONBYTE_HDP).
                                             This parameter must be a value between 0 or 0xFFF */
  uint32_t HDPEndPage;                  /*!< End address that contains the last 256-byte block of HDP area (used for OPTIONBYTE_HDP).
                                             This parameter must be a value between 0 or 0xFFF */
  uint32_t NVState;                     /*!< Value of the non-volatile state (used for OPTIONBYTE_NV).
                                             This parameter must be a value of @ref FLASH_OB_NVSTATE */
  uint32_t ROTConfig;                   /*!< Value of the RoT status (only used for read configuration).
                                             This parameter can be a combination of @ref FLASH_OB_ROT_OEM_PROVD,
                                             @ref FLASH_OB_ROT_DBG_AUTH, @ref FLASH_OB_ROT_IROT_SELECT */
  uint32_t EPOCH;                       /*!< Value of the epoch (only used for read configuration).
                                             This parameter must be a value between 0x0 and 0xFFFFFF */
} FLASH_OBProgramInitTypeDef;

/**
  * @brief  FLASH handle Structure definition
  */
typedef struct
{
  HAL_LockTypeDef        Lock;              /* FLASH locking object */
  uint32_t               ErrorCode;         /* FLASH error code */
  uint32_t               ProcedureOnGoing;  /* Internal variable to indicate which procedure is ongoing or not in IT
                                               context */
  uint32_t               Address;           /* Internal variable to save address selected for program in IT context */
  uint32_t               Sector;            /* Internal variable to define the current sector which is being erased in
                                               IT context */
  uint32_t               NbSectorsToErase;  /* Internal variable to save the remaining sectors to erase in IT context */
} FLASH_ProcessTypeDef;

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup FLASH_Exported_Constants FLASH Exported Constants
  * @{
  */

