RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_flash.h
/** @defgroup FLASH_Flags FLASH Flags Definition
  * @{
  */
#define FLASH_FLAG_EOP               FLASH_ISR_EOPF        /*!< FLASH End of program flag */
#define FLASH_FLAG_WRPERR            FLASH_ISR_WRPERRF     /*!< FLASH Write protection error flag */
#define FLASH_FLAG_PGSERR            FLASH_ISR_PGSERRF     /*!< FLASH Programming sequence error flag */
#define FLASH_FLAG_STRBERR           FLASH_ISR_STRBERRF    /*!< FLASH Strobe error flag */
#define FLASH_FLAG_OBLERR            FLASH_ISR_OBLERRF     /*!< FLASH Option byte loading error flag */
#define FLASH_FLAG_INCERR            FLASH_ISR_INCERRF     /*!< FLASH Inconsistency error flag */
#define FLASH_FLAG_RDSERR            FLASH_ISR_RDSERRF     /*!< FLASH Read security error flag */
#define FLASH_FLAG_SNECCERR          FLASH_ISR_SNECCERRF   /*!< FLASH ECC single error flag */
#define FLASH_FLAG_DBECCERR          FLASH_ISR_DBECCERRF   /*!< FLASH ECC double error flag */
#define FLASH_FLAG_CRCEND            FLASH_ISR_CRCENDF     /*!< FLASH CRC end of calculation flag */
#define FLASH_FLAG_CRCERR            FLASH_ISR_CRCRDERRF   /*!< FLASH CRC error flag  */
#define FLASH_FLAG_KVERR             FLASH_OPTISR_KVEF     /*!< FLASH Key valid error flag */
#define FLASH_FLAG_KTERR             FLASH_OPTISR_KTEF     /*!< FLASH Key transfer error flag */
#define FLASH_FLAG_OPTERR            FLASH_OPTISR_OPTERRF  /*!< FLASH Options byte change error flag */

#define FLASH_FLAG_ISR_ERRORS        (FLASH_FLAG_WRPERR     | FLASH_FLAG_PGSERR   | FLASH_FLAG_STRBERR | \
                                      FLASH_FLAG_OBLERR     | FLASH_FLAG_INCERR   | FLASH_FLAG_RDSERR  | \
                                      FLASH_FLAG_CRCERR)
#define FLASH_FLAG_ECC_ERRORS        (FLASH_FLAG_SNECCERR   | FLASH_FLAG_DBECCERR)
#define FLASH_FLAG_OPTISR_ERRORS     (FLASH_FLAG_KVERR      | FLASH_FLAG_KTERR      | FLASH_FLAG_OPTERR)
#define FLASH_FLAG_ALL_ERRORS        (FLASH_FLAG_ISR_ERRORS | FLASH_FLAG_ECC_ERRORS | FLASH_FLAG_OPTISR_ERRORS)

#define FLASH_FLAG_ISR_FLAGS         (FLASH_FLAG_ISR_ERRORS | FLASH_FLAG_ECC_ERRORS | FLASH_FLAG_EOP)
/**
  * @}
  */

/** @defgroup FLASH_Interrupt_definition FLASH Interrupts Definition
  * @brief FLASH Interrupt definition
  * @{
  */
#define FLASH_IT_EOP                 FLASH_IER_EOPIE       /*!< End of program interrupt source */
#define FLASH_IT_WRPERR              FLASH_IER_WRPERRIE    /*!< FLASH Write protection error interrupt source */
#define FLASH_IT_PGSERR              FLASH_IER_PGSERRIE    /*!< FLASH Programming sequence error interrupt source */
#define FLASH_IT_STRBERR             FLASH_IER_STRBERRIE   /*!< FLASH Strobe error interrupt source */
#define FLASH_IT_OBLERR              FLASH_IER_OBLERRIE    /*!< FLASH Option byte loading error interrupt source */
#define FLASH_IT_INCERR              FLASH_IER_INCERRIE    /*!< FLASH Inconsistency error interrupt source */
#define FLASH_IT_RDSERR              FLASH_IER_RDSERRIE    /*!< FLASH Read security error interrupt source */
#define FLASH_IT_SNECCERR            FLASH_IER_SNECCERRIE  /*!< FLASH ECC single error interrupt source */
#define FLASH_IT_DBECCERR            FLASH_IER_DBECCERRIE  /*!< FLASH ECC double error interrupt source */
#define FLASH_IT_CRCEND              FLASH_IER_CRCENDIE    /*!< FLASH CRC end of calculation interrupt source */
#define FLASH_IT_CRCERR              FLASH_IER_CRCRDERRIE  /*!< FLASH CRC error interrupt source  */
#define FLASH_IT_KVERR               FLASH_OPTCR_KVEIE     /*!< FLASH Key valid error interrupt source */
#define FLASH_IT_KTERR               FLASH_OPTCR_KTEIE     /*!< FLASH Key transfer error interrupt source */
#define FLASH_IT_OPTERR              FLASH_OPTCR_OPTERRIE  /*!< FLASH Options byte change error interrupt source */

#define FLASH_IT_IER                 (FLASH_IT_EOP    | FLASH_IT_WRPERR | FLASH_IT_PGSERR   | FLASH_IT_STRBERR  | \
                                      FLASH_IT_OBLERR | FLASH_IT_INCERR | FLASH_IT_RDSERR | FLASH_IT_SNECCERR | \
                                      FLASH_IT_DBECCERR | FLASH_IT_CRCEND | FLASH_IT_CRCERR)
#define FLASH_IT_OPTCR               (FLASH_IT_KVERR  | FLASH_IT_KTERR    | FLASH_IT_OPTERR)
/**
  * @}
  */

/** @defgroup FLASH_Error FLASH Error
  * @{
  */
#define HAL_FLASH_ERROR_NONE         0x00000000U
#define HAL_FLASH_ERROR_WRP          FLASH_FLAG_WRPERR
#define HAL_FLASH_ERROR_PGS          FLASH_FLAG_PGSERR
#define HAL_FLASH_ERROR_STRB         FLASH_FLAG_STRBERR
#define HAL_FLASH_ERROR_OBL          FLASH_FLAG_OBLERR
#define HAL_FLASH_ERROR_INC          FLASH_FLAG_INCERR
#define HAL_FLASH_ERROR_RDS          FLASH_FLAG_RDSERR
#define HAL_FLASH_ERROR_SNECC        FLASH_FLAG_SNECCERR
#define HAL_FLASH_ERROR_DBECC        FLASH_FLAG_DBECCERR
#define HAL_FLASH_ERROR_CRC          FLASH_FLAG_CRCERR
#define HAL_FLASH_ERROR_KV           FLASH_FLAG_KVERR
#define HAL_FLASH_ERROR_KT           FLASH_FLAG_KTERR
#define HAL_FLASH_ERROR_OPT          FLASH_FLAG_OPTERR
/**
  * @}
  */

/** @defgroup FLASH_Type_Erase FLASH Erase Type
  * @{
  */
#define FLASH_TYPEERASE_SECTORS      FLASH_CR_SER  /*!< Sectors erase activation */
#define FLASH_TYPEERASE_MASSERASE    FLASH_CR_BER  /*!< Flash mass erase activation */
/**
  * @}
  */

/** @defgroup FLASH_Type_Program FLASH Program Type
  * @{
  */
#define FLASH_TYPEPROGRAM_BYTE         (FLASH_CR_PG | FLASH_CR_FW)                             /*!< Program a byte (8-bit) at a specified address */
#define FLASH_TYPEPROGRAM_HALFWORD     (FLASH_HALFWORD_MASK   | FLASH_CR_PG | FLASH_CR_FW)     /*!< Program a half-word (16-bit) at a specified address */
#define FLASH_TYPEPROGRAM_WORD         (FLASH_WORD_MASK       | FLASH_CR_PG | FLASH_CR_FW)     /*!< Program a word (32-bit) at a specified address */
#define FLASH_TYPEPROGRAM_DOUBLEWORD   (FLASH_DOUBLEWORD_MASK | FLASH_CR_PG | FLASH_CR_FW)     /*!< Program a double-word (64-bit) at a specified address */
#define FLASH_TYPEPROGRAM_QUADWORD     (FLASH_CR_PG)                                           /*!< Program a quad-word (128-bit) at a specified address */
#define FLASH_TYPEPROGRAM_OTP_HALFWORD (FLASH_HALFWORD_MASK   | FLASH_CR_PG_OTP | FLASH_CR_FW) /*!< Program a half-word (16-bit) at a OTP address */
#define FLASH_TYPEPROGRAM_OTP_WORD     (FLASH_WORD_MASK       | FLASH_CR_PG_OTP | FLASH_CR_FW) /*!< Program a word (32-bit) at a OTP address */
/**
  * @}
  */

