RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_flash.h
/** @defgroup FLASH_OB_TYPE FLASH Option Bytes Type
  * @{
  */
#define OPTIONBYTE_WRP               0x00000001U   /*!< WRP option byte configuration */
#define OPTIONBYTE_USER              0x00000002U   /*!< User option byte configuration */
#define OPTIONBYTE_HDP               0x00000004U   /*!< HDP option byte configuration */
#define OPTIONBYTE_NV                0x00000008U   /*!< Non-Volatile State option byte configuration */
/**
  * @}
  */

/** @defgroup FLASH_OB_WRP_STATE FLASH Option Bytes WRP State
  * @{
  */
#define OB_WRPSTATE_DISABLE          0x00000000U  /*!< Disable the write protection of the desired sectors */
#define OB_WRPSTATE_ENABLE           0x00000001U  /*!< Enable the write protection of the desired sectors */
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_TYPE FLASH Option Bytes User Type
  * @{
  */
#define OB_USER_BOR_LEV              0x00000001U     /*!< Brownout level */
#define OB_USER_IWDG_SW              0x00000002U     /*!< IWDG control mode */
#define OB_USER_NRST_STOP            0x00000004U     /*!< Stop entry reset */
#define OB_USER_NRST_STDBY           0x00000008U     /*!< Standby entry reset */
#define OB_USER_XSPI1_HSLV           0x00000010U     /*!< XSPI1 High-speed at low voltage */
#define OB_USER_XSPI2_HSLV           0x00000020U     /*!< XSPI2 High-speed at low voltage */
#define OB_USER_IWDG_STOP            0x00000040U     /*!< IWDG Stop mode freeze */
#define OB_USER_IWDG_STDBY           0x00000080U     /*!< IWDG Standby mode freeze */
#define OB_USER_VDDIO_HSLV           0x00000100U     /*!< I/O High-speed at low voltage */
#define OB_USER_ITCM_AXI_SHARE       0x00000200U     /*!< ITCM AXI share */
#define OB_USER_DTCM_AXI_SHARE       0x00000400U     /*!< DTCM AXI share */
#define OB_USER_SRAM_ECC             0x00000800U     /*!< ECC on SRAM */
#define OB_USER_I2C_NI3C             0x00001000U     /*!< I2C Not I3C */
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_BOR_LEV FLASH Option Bytes User BOR Level
  * @{
  */
#define OB_BOR_LEVEL_0               0x00000000U                /*!< BOR OFF, POR/PDR reset threshold level is applied */
#define OB_BOR_LEVEL_1               FLASH_OBW1SRP_BOR_LEVEL_0  /*!< BOR Level 1, the threshold level is low (around 2.1 V) */
#define OB_BOR_LEVEL_2               FLASH_OBW1SRP_BOR_LEVEL_1  /*!< BOR Level 2, the threshold level is medium (around 2.4 V) */
#define OB_BOR_LEVEL_3               FLASH_OBW1SRP_BOR_LEVEL    /*!< BOR Level 3, the threshold level is high (around 2.7 V) */
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_IWDG_SW FLASH Option Bytes User IWDG control mode
  * @{
  */
#define OB_IWDG_HW                   0x00000000U             /*!< IWDG watchdog is controlled by hardware */
#define OB_IWDG_SW                   FLASH_OBW1SRP_IWDG_HW   /*!< IWDG watchdog is controlled by software */
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_nRST_STOP FLASH Option Bytes User stop entry reset
  * @{
  */
#define OB_STOP_RST                  0x00000000U                 /*!< Reset generated when entering stop mode */
#define OB_STOP_NORST                FLASH_OBW1SRP_NRST_STOP     /*!< No reset generated when entering stop mode */
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_nRST_STDBY FLASH Option Bytes User standby entry reset
  * @{
  */
#define OB_STANDBY_RST               0x00000000U                 /*!< Reset generated when entering standby mode */
#define OB_STANDBY_NORST             FLASH_OBW1SRP_NRST_STBY     /*!< No reset generated when entering standby mode */
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_XSPI1_HSLV FLASH Option Bytes User XSPI 1 High-Speed at Low-Voltage
  * @{
  */
#define OB_XSPI1_HSLV_DISABLE        0x00000000U               /*!< I/O speed optimization at low-voltage disabled */
#define OB_XSPI1_HSLV_ENABLE         FLASH_OBW1SRP_XSPI1_HSLV  /*!< I/O speed optimization at low-voltage feature allowed */
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_XSPI2_HSLV FLASH Option Bytes User XSPI 2 High-Speed at Low-Voltage
  * @{
  */
#define OB_XSPI2_HSLV_DISABLE        0x00000000U               /*!< I/O speed optimization at low-voltage disabled */
#define OB_XSPI2_HSLV_ENABLE         FLASH_OBW1SRP_XSPI2_HSLV  /*!< I/O speed optimization at low-voltage feature allowed */
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_IWDG_STOP FLASH Option Bytes User IWDG Stop Mode Freeze
  * @{
  */
#define OB_IWDG_STOP_FREEZE          0x00000000U                 /*!< Independent watchdog frozen in Stop mode */
#define OB_IWDG_STOP_RUN             FLASH_OBW1SRP_IWDG_FZ_STOP  /*!< Independent watchdog running in Stop mode */
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_IWDG_STANDBY FLASH Option Bytes User IWDG Standby Mode Freeze
  * @{
  */
#define OB_IWDG_STDBY_FREEZE         0x00000000U                 /*!< Independent watchdog frozen in Standby mode */
#define OB_IWDG_STDBY_RUN            FLASH_OBW1SRP_IWDG_FZ_STBY  /*!< Independent watchdog running in Standby mode */
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_VDDIO_HSLV FLASH Option Bytes User I/O High-Speed at Low-Voltage
  * @{
  */
#define OB_VDDIO_HSLV_DISABLE        0x00000000U               /*!< I/O speed optimization at low-voltage disabled */
#define OB_VDDIO_HSLV_ENABLE         FLASH_OBW1SRP_VDDIO_HSLV  /*!< I/O speed optimization at low-voltage feature allowed */
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_ITCM_AXI_SHARE FLASH Option Bytes User ITCM AXI share
  * @{
  */
#define OB_ITCM_AXI_SHARE_0          0x00000000U
#define OB_ITCM_AXI_SHARE_1          FLASH_OBW2SRP_ITCM_AXI_SHARE_0
#define OB_ITCM_AXI_SHARE_2          FLASH_OBW2SRP_ITCM_AXI_SHARE_1
#define OB_ITCM_AXI_SHARE_3          (FLASH_OBW2SRP_ITCM_AXI_SHARE_0 | FLASH_OBW2SRP_ITCM_AXI_SHARE_1)
#define OB_ITCM_AXI_SHARE_4          FLASH_OBW2SRP_ITCM_AXI_SHARE_2
#define OB_ITCM_AXI_SHARE_5          (FLASH_OBW2SRP_ITCM_AXI_SHARE_2 | FLASH_OBW2SRP_ITCM_AXI_SHARE_0)
#define OB_ITCM_AXI_SHARE_6          (FLASH_OBW2SRP_ITCM_AXI_SHARE_2 | FLASH_OBW2SRP_ITCM_AXI_SHARE_1)
#define OB_ITCM_AXI_SHARE_7          FLASH_OBW2SRP_ITCM_AXI_SHARE
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_DTCM_AXI_SHARE FLASH Option Bytes User DTCM AXI share
  * @{
  */
#define OB_DTCM_AXI_SHARE_0          0x00000000U
#define OB_DTCM_AXI_SHARE_1          FLASH_OBW2SRP_DTCM_AXI_SHARE_0
#define OB_DTCM_AXI_SHARE_2          FLASH_OBW2SRP_DTCM_AXI_SHARE_1
#define OB_DTCM_AXI_SHARE_3          (FLASH_OBW2SRP_DTCM_AXI_SHARE_0 | FLASH_OBW2SRP_DTCM_AXI_SHARE_1)
#define OB_DTCM_AXI_SHARE_4          FLASH_OBW2SRP_DTCM_AXI_SHARE_2
#define OB_DTCM_AXI_SHARE_5          (FLASH_OBW2SRP_DTCM_AXI_SHARE_2 | FLASH_OBW2SRP_DTCM_AXI_SHARE_0)
#define OB_DTCM_AXI_SHARE_6          (FLASH_OBW2SRP_DTCM_AXI_SHARE_2 | FLASH_OBW2SRP_DTCM_AXI_SHARE_1)
#define OB_DTCM_AXI_SHARE_7          FLASH_OBW2SRP_DTCM_AXI_SHARE
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_ECC_ON_SRAM FLASH Option Bytes User ECC on sRAM
  * @{
  */
#define OB_AXISRAM_ECC_DISABLE       0x00000000U                /*!< AXISRAM ECC check disable */
#define OB_AXISRAM_ECC_ENABLE        FLASH_OBW2SRP_ECC_ON_SRAM  /*!< AXISRAM ECC check enable */
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_I2C_NI3C FLASH Option Bytes User I2C Not I3C
  * @{
  */
#define OB_I2C_NI3C_I2C              FLASH_OBW2SRP_I2C_NI3C
#define OB_I2C_NI3C_I3C              0x00000000U
/**
  * @}
  */

/** @defgroup FLASH_OB_NVSTATE FLASH Option Bytes Non-volatile state
  * @{
  */
#define OB_NVSTATE_OPEN              (uint8_t)0xB4
#define OB_NVSTATE_CLOSE             (uint8_t)0x51
/**
  * @}
  */

/** @defgroup FLASH_OB_ROT_OEM_PROVD FLASH Option Bytes Root-Of-Trust OEM Provisioned state
  * @{
  */
#define OB_OEM_PROVD_ENABLE          (0xB4UL << FLASH_ROTSR_OEM_PROVD_Pos) /*!< Device is in OEM provisioned state */
#define OB_OEM_PROVD_DEFAULT         (0x6AUL << FLASH_ROTSR_OEM_PROVD_Pos) /*!< Device is not in OEM provisioned state (default value)*/
/**
  * @}
  */

