RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_flash.h
/** @defgroup FLASH_Interrupt FLASH Interrupts Macros
  *  @brief macros to handle FLASH interrupts
  * @{
  */

/**
  * @brief  Enable the specified FLASH interrupt.
  * @param  __INTERRUPT__ FLASH interrupt
  *         This parameter can be any combination of the following values:
  *     @arg FLASH_IT_EOP: End of program interrupt
  *     @arg FLASH_IT_WRPERR: Write protection error interrupt
  *     @arg FLASH_IT_PGSERR: Programming sequence error interrupt
  *     @arg FLASH_IT_STRBERR: Strobe error interrupt
  *     @arg FLASH_IT_OBLERR: Option byte loading error interrupt
  *     @arg FLASH_IT_INCERR: Inconsistency error interrupt
  *     @arg FLASH_IT_RDSERR: Read security error interrupt
  *     @arg FLASH_IT_SNECCERR: ECC single error interrupt
  *     @arg FLASH_IT_DBECCERR: ECC double error interrupt
  *     @arg FLASH_IT_CRCEND: CRC end of calculation interrupt
  *     @arg FLASH_IT_CRCERR: CRC error interrupt
  *     @arg FLASH_IT_KVERR: Key valid error interrupt
  *     @arg FLASH_IT_KTERR: Key transfer error interrupt
  *     @arg FLASH_IT_OPTERR: Options byte change error interrupt
  * @retval none
  */
#define __HAL_FLASH_ENABLE_IT(__INTERRUPT__) do { if(((__INTERRUPT__) & FLASH_IT_IER) != 0U)\
                                                  { SET_BIT(FLASH->IER, ((__INTERRUPT__) & FLASH_IT_IER)); }\
                                                  if(((__INTERRUPT__) & FLASH_IT_OPTCR) != 0U)\
                                                  { SET_BIT(FLASH->OPTCR, ((__INTERRUPT__) & FLASH_IT_OPTCR)); }\
                                                } while(0)

/**
  * @brief  Disable the specified FLASH interrupt.
  * @param  __INTERRUPT__ FLASH interrupt
  *         This parameter can be any combination of the following values:
  *     @arg FLASH_IT_EOP: End of program interrupt
  *     @arg FLASH_IT_WRPERR: Write protection error interrupt
  *     @arg FLASH_IT_PGSERR: Programming sequence error interrupt
  *     @arg FLASH_IT_STRBERR: Strobe error interrupt
  *     @arg FLASH_IT_OBLERR: Option byte loading error interrupt
  *     @arg FLASH_IT_INCERR: Inconsistency error interrupt
  *     @arg FLASH_IT_RDSERR: Read security error interrupt
  *     @arg FLASH_IT_SNECCERR: ECC single error interrupt
  *     @arg FLASH_IT_DBECCERR: ECC double error interrupt
  *     @arg FLASH_IT_CRCEND: CRC end of calculation interrupt
  *     @arg FLASH_IT_CRCERR: CRC error interrupt
  *     @arg FLASH_IT_KVERR: Key valid error interrupt
  *     @arg FLASH_IT_KTERR: Key transfer error interrupt
  *     @arg FLASH_IT_OPTERR: Options byte change error interrupt
  * @retval none
  */
#define __HAL_FLASH_DISABLE_IT(__INTERRUPT__) do { if(((__INTERRUPT__) & FLASH_IT_IER) != 0U)\
                                                   { CLEAR_BIT(FLASH->IER, ((__INTERRUPT__) & FLASH_IT_IER)); }\
                                                   if(((__INTERRUPT__) & FLASH_IT_OPTCR) != 0U)\
                                                   { CLEAR_BIT(FLASH->OPTCR, ((__INTERRUPT__) & FLASH_IT_OPTCR)); }\
                                                 } while(0)

/**
  * @brief  Check whether the specified FLASH flag is set or not.
  * @param  __FLAG__ specifies the FLASH flag to check.
  *   This parameter can be one of the following values:
  *     @arg FLASH_FLAG_EOP: FLASH End of program flag
  *     @arg FLASH_FLAG_WRPERR: FLASH Write protection error flag
  *     @arg FLASH_FLAG_PGSERR: FLASH Programming sequence error flag
  *     @arg FLASH_FLAG_STRBERR: FLASH Strobe error flag
  *     @arg FLASH_FLAG_OBLERR: FLASH Option byte loading error flag
  *     @arg FLASH_FLAG_INCERR: FLASH Inconsistency error flag
  *     @arg FLASH_FLAG_RDSERR: FLASH Read security error flag
  *     @arg FLASH_FLAG_SNECCERR: FLASH ECC single error flag
  *     @arg FLASH_FLAG_DBECCERR: FLASH ECC double error flag
  *     @arg FLASH_FLAG_CRCEND: FLASH CRC end of calculation flag
  *     @arg FLASH_FLAG_CRCERR: FLASH CRC error flag
  *     @arg FLASH_FLAG_KVERR: FLASH Key valid error flag
  *     @arg FLASH_FLAG_KTERR: FLASH Key transfer error flag
  *     @arg FLASH_FLAG_OPTERR: FLASH Options byte change error flag
  * @retval The new state of FLASH_FLAG (SET or RESET).
  */
#define __HAL_FLASH_GET_FLAG(__FLAG__) ((((__FLAG__) & FLASH_FLAG_OPTISR_ERRORS) != 0U) ? \
                                        (READ_BIT(FLASH->OPTISR, (__FLAG__)) == (__FLAG__)) : \
                                        (READ_BIT(FLASH->ISR, (__FLAG__)) == (__FLAG__)))

/**
  * @brief  Clear the FLASH's pending flags.
  * @param  __FLAG__ specifies the FLASH flags to clear.
  *   This parameter can be any combination of the following values:
  *     @arg FLASH_FLAG_EOP: FLASH End of program flag
  *     @arg FLASH_FLAG_WRPERR: FLASH Write protection error flag
  *     @arg FLASH_FLAG_PGSERR: FLASH Programming sequence error flag
  *     @arg FLASH_FLAG_STRBERR: FLASH Strobe error flag
  *     @arg FLASH_FLAG_OBLERR: FLASH Option byte loading error flag
  *     @arg FLASH_FLAG_INCERR: FLASH Inconsistency error flag
  *     @arg FLASH_FLAG_RDSERR: FLASH Read security error flag
  *     @arg FLASH_FLAG_SNECCERR: FLASH ECC single error flag
  *     @arg FLASH_FLAG_DBECCERR: FLASH ECC double error flag
  *     @arg FLASH_FLAG_CRCEND: FLASH CRC end of calculation flag
  *     @arg FLASH_FLAG_CRCERR: FLASH CRC error flag
  *     @arg FLASH_FLAG_KVERR: FLASH Key valid error flag
  *     @arg FLASH_FLAG_KTERR: FLASH Key transfer error flag
  *     @arg FLASH_FLAG_OPTERR: FLASH Options byte change error flag
  * @retval None
  */
#define __HAL_FLASH_CLEAR_FLAG(__FLAG__) do { if(((__FLAG__) & FLASH_FLAG_OPTISR_ERRORS) != 0U)\
                                              { WRITE_REG(FLASH->OPTICR, ((__FLAG__) & FLASH_FLAG_OPTISR_ERRORS)); }\
                                              if(((__FLAG__) & FLASH_FLAG_ISR_FLAGS) != 0U)\
                                              { WRITE_REG(FLASH->ICR, ((__FLAG__) & FLASH_FLAG_ISR_FLAGS)); }\
                                            } while(0)
/**
  * @}
  */

/* Include FLASH HAL Extended module */
#include "stm32h7rsxx_hal_flash_ex.h"


/* Exported functions --------------------------------------------------------*/
/** @addtogroup FLASH_Exported_Functions
  * @{
  */

/* Program operation functions  ***********************************************/
/** @addtogroup FLASH_Exported_Functions_Group1
  * @{
  */
HAL_StatusTypeDef  HAL_FLASH_Program(uint32_t TypeProgram, uint32_t Address, uint32_t DataAddress);
HAL_StatusTypeDef  HAL_FLASH_Program_IT(uint32_t TypeProgram, uint32_t Address, uint32_t DataAddress);
/* FLASH IRQ handler method */
void               HAL_FLASH_IRQHandler(void);
/* Callbacks in non blocking modes */
void               HAL_FLASH_EndOfOperationCallback(uint32_t ReturnValue);
void               HAL_FLASH_OperationErrorCallback(uint32_t ReturnValue);
/**
  * @}
  */

/* Peripheral Control functions  **********************************************/
/** @addtogroup FLASH_Exported_Functions_Group2
  * @{
  */
HAL_StatusTypeDef  HAL_FLASH_Unlock(void);
HAL_StatusTypeDef  HAL_FLASH_Lock(void);
/* Option bytes control */
HAL_StatusTypeDef  HAL_FLASH_OB_Unlock(void);
HAL_StatusTypeDef  HAL_FLASH_OB_Lock(void);
/**
  * @}
  */

